# [Pandas](http://pandas.pydata.org/)

## 1. Introducing Pandas objects

Three important pandas objects are 
1. Series
2. DataFrame
3. Index

In [2]:
import numpy as np 
import pandas as pd

In [83]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
pd.__version__

'0.24.2'

### 1.1 Pandas Series object 

A Pandas Series is a one-dimensional array of indexed data. It can be created from a
list or array as follows

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [6]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

As we see in the preceding output, the Series wraps both a sequence of values and a
sequence of indices, which we can access with the values and index attributes. The
values are simply a familiar NumPy array

In [8]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [10]:
data.index # Array like object of type pd.Index

RangeIndex(start=0, stop=4, step=1)

In [11]:
data[1] # Accessing using the index

0.5

In [12]:
data[1 : 3] # Slicing

1    0.50
2    0.75
dtype: float64

### Difference between the pandas Series and numpy array
The essential difference is the presence
of the index: while the NumPy array has an implicitly defined integer index used
to access the values, the Pandas Series has an explicitly defined index associated with
the values.

In [13]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd']); data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data['b'] #accessing using the index

0.5

#### Series can be created using a dict object

In [15]:
population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [16]:
population['California'] # accessing using the key

38332521

In [17]:
population['California' : 'Illinois'] #Here the end index value is also included

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

### 1.2 Constructing Series Object

In [18]:
pd.Series([2, 4, 6]) # Simple

0    2
1    4
2    6
dtype: int64

In [19]:
pd.Series(5, index=[100, 200, 300]) # Scalar with multipile indexing

100    5
200    5
300    5
dtype: int64

In [20]:
pd.Series({2:'a', 1:'b', 3:'c'}) #Using dict

2    a
1    b
3    c
dtype: object

In [21]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2]) # Using dict with required index

3    c
2    a
dtype: object

## 1.3 Pandas DataFrame object

In [22]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}

In [23]:
area = pd.Series(area_dict)

In [27]:
states = pd.DataFrame({'population': population, 'area': area}); states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Like the Series object, the DataFrame has an index attribute that gives access to the
index labels

In [28]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [29]:
states.columns

Index(['population', 'area'], dtype='object')

In [30]:
states['area'] # Accessing using the column name

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### Difference between array and dataframe
Notice the potential point of confusion here: in a two-dimensional NumPy array,
data[0] will return the first row. For a DataFrame, data['col0'] will return the first
column. Because of this, it is probably better to think about DataFrames as generalized
dictionaries rather than generalized arrays, though both ways of looking at the situation
can be useful.

### 1.4 Constructing DataFrames

In [31]:
pd.DataFrame(population, columns=['population']) # Using single series

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [33]:
data = [{'a': i, 'b': 2 * i}
for i in range(3)]
pd.DataFrame(data) # Using list of dict

   a  b
0  0  0
1  1  2
2  2  4

In [34]:
pd.DataFrame({'population': population,
'area': area}) # From dict of series object

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [35]:
pd.DataFrame(np.random.rand(3, 2),
columns=['foo', 'bar'],
index=['a', 'b', 'c']) # From numpy array

        foo       bar
a  0.768177  0.863347
b  0.546546  0.628326
c  0.051080  0.094082

In [36]:
A = np.zeros(3, dtype = [('A', 'i8'), ('B', 'f8')]) ; A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [37]:
pd.DataFrame(A) # Using structured numpy array

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## 1.5 Pandas Index Object

__*Index*__ is an **immutable** array

In [38]:
ind = pd.Index([2, 3, 5, 7, 11])

In [39]:
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [40]:
ind[1], ind[::2]

(3, Int64Index([2, 5, 11], dtype='int64'))

### Index as Ordered Set

In [42]:
indA = pd.Index([1, 3, 4, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [43]:
indA & indB # intersection

Int64Index([3, 7], dtype='int64')

In [44]:
indA | indB # Union

Int64Index([1, 2, 3, 4, 5, 7, 9, 11], dtype='int64')

In [45]:
indA ^ indB # symmetric diff

Int64Index([1, 2, 4, 5, 9, 11], dtype='int64')

## 2. Data Indexing and Selection

### 2.1 Data Selection in Series

In [49]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
index=['a', 'b', 'c', 'd']); data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [50]:
data['b'] # using the key

0.5

In [52]:
'a' in data #Membership operator

True

In [53]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [54]:
list(data.items()) #dict key words

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

Series objects can even be modified with a dictionary-like syntax. Just as you can
extend a dictionary by assigning to a new key, you can extend a Series by assigning
to a new index value

In [56]:
data['e'] = 1.25; data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

### 2.1.1 Series as one-dimensional array

In [57]:
data['a' : 'c'] #slicing by explicit index

a    0.25
b    0.50
c    0.75
dtype: float64

In [58]:
data[0:2] #Slicing iwth implicit index

a    0.25
b    0.50
dtype: float64

In [59]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [60]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

Among these, slicing may be the source of the most confusion. Notice that when you
are slicing with an explicit index (i.e., data['a':'c']), the final index is included in
the slice, while when you’re slicing with an implicit index (i.e., data[0:2]), the final
index is excluded from the slice.

### 2.1.2 Indexes: loc, iloc, ix

* __loc__ : Always uses explicit index for indexing and slicing
* __iloc__ : Always uses implicit index for indexing and slicing
* __ix__ :  Hybrid way of using the index mostly useful for dataframes

In [62]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [63]:
data[1] # explicit index while indexing

'a'

In [64]:
data[1: 3] #implicit index while slicing

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to
the data in the Series.

In [65]:
data.loc[1] # Explicit indexing

'a'

In [66]:
data.loc[1:3] # Explicit slicing

1    a
3    b
dtype: object

In [67]:
data.iloc[1] # Implicit indexing

'b'

In [69]:
data.iloc[1:3] # Implicit slicing

3    b
5    c
dtype: object

### 2.2 Data Selection in DataFrame

### 2.2.1 DataFrame as dictionary

In [70]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [71]:
data['area'] #Individual series with the key

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [72]:
data.area # Attribute style

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [73]:
data.area is data['area']

True

In [75]:
# creating a new column 
data['density'] = data['pop'] / data['area']; data.density

California     90.413926
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
Name: density, dtype: float64

### 2.2.2 DataFrame as two-dimensional array

In [76]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [77]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [78]:
data.iloc[:3, :2] #Implicit Slicing

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [79]:
data.loc[:'Illinois', :'pop'] #Explicit Slicing

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [84]:
data.ix[:3, :'pop'] #hybrid slicing # deprecated

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

## 3. Operations on  Data

### 3.1 UFuncs: Index Preservation

In [85]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [87]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [88]:
np.exp(ser) #UFuncs on the series preserving index

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [89]:
np.sin(df * np.pi / 4)

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

### 3.2 UFuncs: Index Alignment

#### 3.2.1 Index alignment in Series

In [90]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [92]:
population / area  #if the index is missing then it is aligned

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [93]:
area.index | population.index #Union of the indexes

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [94]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [95]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

#### 3.2.2 Index alignment in DataFrame

In [97]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB')) 
A

    A  B
0  18  6
1   8  6

In [98]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
B

   B  A  C
0  1  3  8
1  1  9  8
2  9  4  1

In [99]:
A + B

      A    B   C
0  21.0  7.0 NaN
1  17.0  7.0 NaN
2   NaN  NaN NaN

In [106]:
fill = A.stack().mean()

In [107]:
A.add(B, fill_value=fill)

      A     B     C
0  21.0   7.0  17.5
1  17.0   7.0  17.5
2  13.5  18.5  10.5

### 3.3 UFuncs: Operations Between DataFrame and Series

In [109]:
A = rng.randint(10, size=(3, 4))
A

array([[3, 6, 7, 2],
       [0, 3, 1, 7],
       [3, 1, 5, 5]])

In [110]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-3, -3, -6,  5],
       [ 0, -5, -2,  3]])

In [111]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3 -3 -6  5
2  0 -5 -2  3

In [112]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    7
Name: 0, dtype: int32

## 4. Handling Missing Data

### 4.1 None as missing data

In [114]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [115]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

### 4.2 NaN as missing data

In [116]:
vals2 = np.array([1, np.nan, 3, 4])
vals2

array([ 1., nan,  3.,  4.])

In [117]:
1 + np.nan

nan

In [118]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [119]:
#special sums with neglecting nan value

np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

### 4.3 NaN and None in Pandas

In [120]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [121]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [123]:
x[0] = None; x

0    NaN
1    1.0
dtype: float64

![Conversion](Conversion.PNG)

### 4.4 Operating on Null Values


* isnull() - Generate a Boolean mask indicating missing values
* notnull() - Opposite of isnull()
* dropna() - Return a filtered version of the data
* fillna() - Return a copy of the data with filled

#### 4.1 Detecting null values

In [125]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull() #Check the null

0    False
1     True
2    False
3     True
dtype: bool

In [126]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### 4.2 Dropping null values

In [127]:
data.dropna()

0        1
2    hello
dtype: object

In [128]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [129]:
df.dropna() # returns only the rows and cols without NaN

     0    1  2
1  2.0  3.0  5

In [130]:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [131]:
df.dropna(axis='columns', how='all') #neglect the column if all the ele's are None

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [132]:
df.dropna(axis='rows', thresh=3) #threshold gives the number

     0    1  2
1  2.0  3.0  5

#### 4.3 Filling null values

In [133]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [134]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [135]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [136]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [137]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [138]:
df.fillna(method = 'ffill', axis = 1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

## 5. Hierarchical Indexing

Up to this point we’ve been focused primarily on one-dimensional and twodimensional
data, stored in Pandas Series and DataFrame objects, respectively. Often
it is useful to go beyond this and store higher-dimensional data—that is, data indexed
by more than one or two keys. While Pandas does provide Panel and Panel4D objects
that natively handle three-dimensional and four-dimensional data, a far more common pattern in practice is to make use of hierarchical
indexing (also known as multi-indexing) to incorporate multiple index levels within a
single index. In this way, higher-dimensional data can be compactly represented
within the familiar one-dimensional Series and two-dimensional DataFrame objects.

### 5.1 A Multiply Indexed Series

In [3]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

With this indexing scheme, you can straightforwardly index or slice the series based
on this multiple index

In [4]:
pop[('California', 2010):('Texas', 2000)] #multiple indexing

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [5]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

#### 5.1.2 Pandas MultiIndex

In [7]:
index = pd.MultiIndex.from_tuples(index); index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

Notice that the MultiIndex contains multiple levels of indexing—in this case, the state
names and the years, as well as multiple labels for each data point which encode these
levels.
If we reindex our series with this MultiIndex, we see the hierarchical representation
of the data

In [8]:
pop = pop.reindex(index)

In [9]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### 5.1.3 MultiIndex as extra dimension

In [12]:
pop_df = pop.unstack();
"""The unstack() method will quickly convert a multiplyindexed
Series into a conventionally indexed DataFrame"""
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

#### 5.1.4 Explicit MultiIndex Constructors

In [13]:
#From arrays
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [14]:
# From tuples 
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [15]:
# From Cartesian products 
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [16]:
# From levels
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

C:\Users\i332835\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead
  This is separate from the ipykernel package so we can avoid doing imports until

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

#### 5.1.5 MultiIndex level names

In [17]:
pop.index.names = ['state', 'year']

In [18]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### 5.1.6 MultiIndex for columns

In [19]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])

In [20]:
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

In [21]:
#create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  37.1  37.0  38.9  52.0  35.8
     2      45.0  36.5  19.0  36.1  37.0  36.8
2014 1      39.0  36.2  24.0  37.4  35.0  37.2
     2      34.0  36.6  41.0  37.2  17.0  37.5

### 5.2 Indexing and Slicing a MultiIndex

#### 5.2.1 Multiply indexed Series

In [22]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [25]:
pop[('California', 2000)]

33871648

#### 5.2.2 Multiply Indexed DataFrames
A multiply indexed DataFrame behaves in a similar manner. Consider our toy medical
DataFrame from before

In [26]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  37.1  37.0  38.9  52.0  35.8
     2      45.0  36.5  19.0  36.1  37.0  36.8
2014 1      39.0  36.2  24.0  37.4  35.0  37.2
     2      34.0  36.6  41.0  37.2  17.0  37.5

In [27]:
health_data['Guido', 'HR'] #Column with multiIndex

year  visit
2013  1        37.0
      2        19.0
2014  1        24.0
      2        41.0
Name: (Guido, HR), dtype: float64

In [28]:
health_data.iloc[:2, :2] #implicit indexing

subject      Bob
type          HR  Temp
year visit
2013 1      42.0  37.1
     2      45.0  36.5

In [29]:
health_data.loc[:, ('Bob', 'HR')] #Explicit indexing

year  visit
2013  1        42.0
      2        45.0
2014  1        39.0
      2        34.0
Name: (Bob, HR), dtype: float64

In [30]:
health_data.loc[(:, 1), (:, 'HR')] #Error as the hybrid

SyntaxError: invalid syntax (<ipython-input-30-b685e60c0fc6>, line 1)

You could get around this by building the desired slice explicitly using Python’s builtin
slice() function, but a better way in this context is to use an IndexSlice object,
which Pandas provides for precisely this situation

In [31]:
idx = pd.IndexSlice
health_data.loc[idx[:,1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      42.0  37.0  52.0
2014 1      39.0  24.0  35.0

### 5.3 Rearranging Multi-Indices

#### 5.3.1 Sorted and unsorted indices

In [32]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.661170
      2      0.216631
c     1      0.719728
      2      0.922399
b     1      0.309300
      2      0.562432
dtype: float64

For various reasons, partial slices and other similar operations
require the levels in the MultiIndex to be in sorted (i.e., lexographical) order.
Pandas provides a number of convenience routines to perform this type of sorting;
examples are the sort_index() and sortlevel() methods of the DataFrame. We’ll
use the simplest, sort_index().

In [33]:
data = data.sort_index()
data

char  int
a     1      0.661170
      2      0.216631
b     1      0.309300
      2      0.562432
c     1      0.719728
      2      0.922399
dtype: float64

#### 5.3.2 Stacking and unstacking

In [35]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [37]:
pop.unstack(level = 0) #level : state

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [38]:
pop.unstack(level = 1) #level : year

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

#### 5.3.3 Index setting and resetting

In [40]:
pop_flat = pop.reset_index(name = 'population')

In [41]:
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [42]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### 5.4 Data Aggregations on Multi-Indices

In [44]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  37.1  37.0  38.9  52.0  35.8
     2      45.0  36.5  19.0  36.1  37.0  36.8
2014 1      39.0  36.2  24.0  37.4  35.0  37.2
     2      34.0  36.6  41.0  37.2  17.0  37.5

In [45]:
health_data.mean(level = 'year')

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR   Temp
year
2013     43.5  36.8  28.0  37.5  44.5  36.30
2014     36.5  36.4  32.5  37.3  26.0  37.35

In [47]:
health_data.mean(axis = 1, level = 'type') 

# (HR in Bob + HR in Guido + HR in Sue) / 3.0

type               HR       Temp
year visit
2013 1      43.666667  37.266667
     2      33.666667  36.466667
2014 1      32.666667  36.933333
     2      30.666667  37.100000

## 6 Combining Datasets: Concat and Append

### 6.1 Simple Concatenation with pd.concat

In [3]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [4]:
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [7]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
    for c in cols}
    return pd.DataFrame(data, ind)

In [8]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])

In [10]:
x

    A   B
0  A0  B0
1  A1  B1

In [11]:
y

    A   B
2  A2  B2
3  A3  B3

In [12]:
y.index = x.index

In [13]:
print(x); print(y); pd.concat([x, y])

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

#### 6.1.1 Catching the repeats as an error

If you’d like to simply verify that the indices in the
result of pd.concat() do not overlap, you can specify the verify_integrity flag.
With this set to True, the concatenation will raise an exception if there are duplicate
indices. Here is an example, where for clarity we’ll catch and print the error message

In [15]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

#### 6.1.2 Ignoring the index

In [16]:
print(pd.concat([x, y], ignore_index = True))

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

#### 6.1.3 Adding MultiIndex keys

In [19]:
print(pd.concat([x, y], keys = ['x', 'y']))

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

### 6.2 Concatenation with joins

In [21]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); print(df6); print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\i332835\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [22]:
print(pd.concat([df5, df6], join='inner')) # join = inner

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

Another option is to directly specify the index of the remaining colums using the
join_axes argument, which takes a list of index objects. Here we’ll specify that the
returned columns should be the same as those of the first input.

In [23]:
print(pd.concat([df5, df6], join_axes=[df5.columns]))

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

#### 6.2.1 The append() method
Because direct array concatenation is so common, Series and DataFrame objects
have an append method that can accomplish the same thing in fewer keystrokes. For
example, rather than calling pd.concat([df1, df2]), you can simply call
df1.append(df2)

In [25]:
print(x.append(y))

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

Keep in mind that unlike the append() and extend() methods of Python lists, the
append() method in Pandas does not modify the original object—instead, it creates a
new object with the combined data.

### 6.3 Combining Datasets: Merge and Join

#### 6.3.1 Categories in Joins

##### 6.3.1.1 One-to-one joins

In [3]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})

In [4]:
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [5]:
df3 = pd.merge(df1, df2)

In [6]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

##### 6.3.1.2 Many-to-one joins
Many-to-one joins are joins in which one of the two key columns contains duplicate
entries. For the many-to-one case, the resulting DataFrame will preserve those duplicate
entries as appropriate. Consider the following example of a many-to-one join

In [8]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

##### 6.3.1.3 Many-to-many joins
Many-to-many joins are a bit confusing conceptually, but are nevertheless well
defined. If the key column in both the left and right array contains duplicates, then
the result is a many-to-many merge. This will be perhaps most clear with a concrete
example. Consider the following, where we have a DataFrame showing one or more
skills associated with a particular group.
By performing a many-to-many join, we can recover the skills associated with any
individual person:

In [9]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'], 'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})

In [14]:
print(df1); print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [15]:
print(pd.merge(df1, df5))

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

#### 6.3.2 Specification of the Merge Key
We’ve already seen the default behavior of pd.merge(): it looks for one or more
matching column names between the two inputs, and uses this as the key. However,
often the column names will not match so nicely, and pd.merge() provides a variety
of options for handling this.

##### 6.3.2.1 The on keyword

In [17]:
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

##### 6.3.2.2 The left_on, right_on and drop keywords

In [20]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [21]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000